In [1]:
import pandas as pd
import numpy as np

np.random.seed(123)

students = ['Sally', 'Jane', 'Suzie', 'Billy', 'Ada', 'John', 'Thomas',
            'Marie', 'Albert', 'Richard', 'Isaac', 'Alan']

# randomly generate scores for each student for each subject
# note that all the values need to have the same length here
math_grades = np.random.randint(low=60, high=100, size=len(students))
english_grades = np.random.randint(low=60, high=100, size=len(students))
reading_grades = np.random.randint(low=60, high=100, size=len(students))

df = pd.DataFrame({'name': students,
                   'math': math_grades,
                   'english': english_grades,
                   'reading': reading_grades})

type(df)

pandas.core.frame.DataFrame

In [8]:
books = [
    {
        "title": "Thing",
        "author": "Author Name"
    },
    {
        "title": "Thing1",
        "author": "Author1 Name1"
    },
    {
        "title": "Thing2",
        "author": "Author2 Name2"
    }
]

In [9]:
df = pd.DataFrame(books)
df

    title         author
0   Thing    Author Name
1  Thing1  Author1 Name1
2  Thing2  Author2 Name2

In [10]:
df.title

0     Thing
1    Thing1
2    Thing2
Name: title, dtype: object

In [11]:
df["title"]

0     Thing
1    Thing1
2    Thing2
Name: title, dtype: object

In [12]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 2 columns):
title     3 non-null object
author    3 non-null object
dtypes: object(2)
memory usage: 176.0+ bytes

In [13]:
df.index

RangeIndex(start=0, stop=3, step=1)

In [14]:
df.columns

Index(['title', 'author'], dtype='object')

In [15]:
df.describe()

         title       author
count        3            3
unique       3            3
top     Thing1  Author Name
freq         1            1

In [19]:
df["quantity"] = [10, 20, 100]

In [20]:
df["price"] = [50, 14, 19.99]

In [22]:
df["inventory_value"] = df.price * df.quantity

In [23]:
df

    title         author  quantity  price  inventory_value
0   Thing    Author Name        10  50.00            500.0
1  Thing1  Author1 Name1        20  14.00            280.0
2  Thing2  Author2 Name2       100  19.99           1999.0

In [24]:
df.price = df.price * 2

In [25]:
df.describe()

         quantity       price  inventory_value
count    3.000000    3.000000         3.000000
mean    43.333333   55.993333       926.333333
std     49.328829   38.578752       935.446596
min     10.000000   28.000000       280.000000
25%     15.000000   33.990000       390.000000
50%     20.000000   39.980000       500.000000
75%     60.000000   69.990000      1249.500000
max    100.000000  100.000000      1999.000000

In [26]:
df[["quantity", "price"]]

   quantity   price
0        10  100.00
1        20   28.00
2       100   39.98

In [27]:
df.T

                           0              1              2
title                  Thing         Thing1         Thing2
author           Author Name  Author1 Name1  Author2 Name2
quantity                  10             20            100
price                    100             28          39.98
inventory_value          500            280           1999

In [28]:
df[df.price < 100]

    title         author  quantity  price  inventory_value
1  Thing1  Author1 Name1        20  28.00            280.0
2  Thing2  Author2 Name2       100  39.98           1999.0

In [30]:
# OR
df[df.price < 100 | df.title.str.contains("Thing")]

Empty DataFrame
Columns: [title, author, quantity, price, inventory_value]
Index: []

In [31]:
# Mutating in placce vs returning a copy
df.drop(columns=['inventory_value']) # .drop returns a copy by default, just reassign to carry forward

    title         author  quantity   price
0   Thing    Author Name        10  100.00
1  Thing1  Author1 Name1        20   28.00
2  Thing2  Author2 Name2       100   39.98

In [32]:
df.drop(columns=['inventory_value'], inplace=True) # inplace mutates the orignal

In [33]:
df

    title         author  quantity   price
0   Thing    Author Name        10  100.00
1  Thing1  Author1 Name1        20   28.00
2  Thing2  Author2 Name2       100   39.98

In [2]:
print(df)

       name  math  english  reading
0     Sally    62       85       80
1      Jane    88       79       67
2     Suzie    94       74       95
3     Billy    98       96       88
4       Ada    77       92       98
5      John    79       76       93
6    Thomas    82       64       81
7     Marie    93       63       90
8    Albert    92       62       87
9   Richard    69       80       94
10    Isaac    92       99       93
11     Alan    92       62       72

In [3]:
df

       name  math  english  reading
0     Sally    62       85       80
1      Jane    88       79       67
2     Suzie    94       74       95
3     Billy    98       96       88
4       Ada    77       92       98
5      John    79       76       93
6    Thomas    82       64       81
7     Marie    93       63       90
8    Albert    92       62       87
9   Richard    69       80       94
10    Isaac    92       99       93
11     Alan    92       62       72

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12 entries, 0 to 11
Data columns (total 4 columns):
name       12 non-null object
math       12 non-null int64
english    12 non-null int64
reading    12 non-null int64
dtypes: int64(3), object(1)
memory usage: 512.0+ bytes

In [5]:
df.describe()

            math    english    reading
count  12.000000  12.000000  12.000000
mean   84.833333  77.666667  86.500000
std    11.134168  13.371158   9.643651
min    62.000000  62.000000  67.000000
25%    78.500000  63.750000  80.750000
50%    90.000000  77.500000  89.000000
75%    92.250000  86.750000  93.250000
max    98.000000  99.000000  98.000000